In [1]:
import pandas as pd 
import numpy as np

In [2]:
data = pd.read_csv('C:/Users/bhatt/OneDrive/Desktop/whisper-main/Titanic_Dataset/train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
cols_dropped = ['PassengerId', 'Name', 'Ticket', 'Cabin']

In [5]:
data = data.drop(cols_dropped, axis = 1)

In [6]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [7]:
from sklearn.preprocessing import LabelEncoder

In [8]:
label_enc = LabelEncoder()

In [9]:
data['Sex'] = label_enc.fit_transform(data['Sex'])
data['Embarked'] = label_enc.fit_transform(data['Embarked'])

In [10]:
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [11]:
data.isna().sum()
data['Age'] = data['Age'].fillna(data['Age'].mean())

In [12]:
data.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [13]:
Y_data = data['Survived']
X_data = data

In [14]:
X_data = X_data.drop(['Survived'], axis = 1)

In [15]:
X_data.shape, Y_data.shape

((891, 7), (891,))

In [16]:
def entropy(col):
    favour = np.unique(col, return_counts = True)
    total = col.shape[0]
    ent = 0
    
    for i in favour[1]:
        prob = i/total
        ent = -1 * (prob * np.log2(prob))
    return ent

In [17]:
# a = [0,1,0,1,0,1,0,0,1,1,0,1,0,1,0,1,0,0,1,1,0]
# print(np.unique(a, return_counts=True))

In [18]:
def divide_data(X_data, feat, threshold):
    X_right = pd.DataFrame([], columns = X_data.columns)
    X_left = pd.DataFrame([], columns = X_data.columns)
    
    for i in range(X_data.shape[0]):
        value = X_data[feat].loc[i]
        
        if value >= threshold:
            X_right = pd.concat([X_right, X_data.iloc[i : i + 1]])
        else:
            X_left = pd.concat([X_left, X_data.iloc[i : i + 1]])
    return X_left, X_right

In [19]:
left, right = divide_data(X_data[:10], 'Sex', 0.5)

In [20]:
print(left)

  Pclass Sex   Age SibSp Parch     Fare Embarked
1      1   0  38.0     1     0  71.2833        0
2      3   0  26.0     0     0   7.9250        2
3      1   0  35.0     1     0  53.1000        2
8      3   0  27.0     0     2  11.1333        2
9      2   0  14.0     1     0  30.0708        0

In [21]:
print(right)

  Pclass Sex        Age SibSp Parch     Fare Embarked
0      3   1  22.000000     1     0   7.2500        2
4      3   1  35.000000     0     0   8.0500        2
5      3   1  29.699118     0     0   8.4583        1
6      1   1  54.000000     0     0  51.8625        2
7      3   1   2.000000     3     1  21.0750        2